Tutorials/1D/WC-Blast/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// middle region values
defaultFieldValues
(
    volScalarFieldValue T 0.025
    volScalarFieldValue p 0.01
    volVectorFieldValue U (0 0 0 )
);

regions
(
    //right region values
    boxToCell
    {
        box ( 0.9 -1 -1 ) ( 1 1  1 );
        fieldValues
        (
            volScalarFieldValue T 250
            volScalarFieldValue p 100
            volVectorFieldValue U (0 0 0)
        );
    }

    //left region values
    boxToCell
    {
        box ( 0 -1 -1 ) ( 0.1 1  1 );
        fieldValues
        (
            volScalarFieldValue T 2500
            volScalarFieldValue p 1000
            volVectorFieldValue U (0 0 0)
        );
    }
);


// ************************************************************************* //
